# GetCropRegionShapeManager Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetCropRegionShapeManager Method
View Class See Also
---
Returns an object for managing view crop region shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ViewCropRegionShapeManager GetCropRegionShapeManager()
```

Visual Basic
---
```text
Public Function GetCropRegionShapeManager As ViewCropRegionShapeManager
```

Visual C++
---
```text
public:
ViewCropRegionShapeManager^ GetCropRegionShapeManager()
```

# ### Return Value
The crop region shape manager.
# See Also
View Class
Autodesk.Revit.DB Namespace